name: "sentinel_model"
platform: "onnxruntime_onnx"
max_batch_size: 64

dynamic_batching {
  preferred_batch_size: [8, 16, 32]
  max_queue_delay_microseconds: 500
}

input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [436]
  }
]

output [
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [2]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
